Repository: intersignature/TrainMe
Catalog: TrainMe/*.lproj/Localizable.strings
Languages: th

source: Ok
th: ตกลง

source: cancel
th: ยกเลิก

source: Loading ...
th: กำลังโหลด ...

# signup_email
source: Sign up
th: สมัครผ่านอีเมลล์

# signup_facebook
source: Continue with facebook
th: เข้าสู่ระบบผ่าน facebook

# already_user
source: Already a user?
th: มีบัญชีอยู่แล้ว?

source: Log in
th: เข้าสู่ระบบ

source: Forget password?
th: ลืมรหัสผ่าน?

source: Your account was banned by admin
th: บัญชีของท่านถูกระงับการใช้งานโดนผู้ดูแลระบบ

source: Please verify email
th: กรุณายืนยันอีเมลล์

source: Register
th: สมัคร

source: Full name
th: ชื่อเต็ม

source: Next
th: ต่อไป

source: Please enter your fullname
th: กรุณากรอกชื่อและนามสกุลของท่าน

source: Email
th: อีเมลล์

# email_description
source: You'll need to confirm this email later.
th: กรุณายืนยันอีเมลล์

source: Password
th: รหัสผ่าน

# password_description
source: Use at least 8 characters.
th: รหัสผ่านจะต้องมากกว่า 8 ตัวอักษร

source: Verify password
th: ยืนยันรหัสผ่าน

# verify_password_description
source: Confirm your password.
th: กรอกรหัสผ่านอีกครั้ง

source: Please enter your email
th: กรุณากรอกอีเมลล์

source: Please enter your valid email
th: กรุณากรอกอีเมลล์ให้ถูกต้อง

source: Please enter your password
th: กรุณากรอกรหัสผ่าน

source: Please enter your verify password
th: กรุณายืนยันรหัสผ่าน

source: Please enter your password at least 8 characters
th: กรุณากรอกรหัสผ่านที่มากกว่า 8 ตัวอักษร

source: Your password doesn't match
th: รหัสผ่านไม่ตรงกัน

source: Date of birth
th: วันเกิด

source: DD
th: วว

source: MM
th: ดด

source: YYYY
th: ปี

source: Weight
th: น้ำหนัก

source: Height
th: ส่วนสูง

source: Kg
th: กก.

source: Cm
th: ซม.

source: Male
th: ชาย

source: Female
th: หญิง

source: Submit
th: ยืนยัน

source: Please enter your date of birth
th: กรุณากรอกวันเกิด

source: Email is already in use
th: อีเมลล์ถูกใช้งานแล้ว

source: Please enter your weight
th: กรุณากรอกน้ำหนัก

source: Please enter your height
th: กรุณากรอกส่วนสูง

source: Successfully send verification email!
th: ระบบได้ทำการส่งเมลล์ในการยืนยันอีเมลล์เรียบร้อยแล้ว!

source: Done
th: เสร็จ

source: Recovery your account
th: รีเซตรหัสผ่าน

# recovery_your_account_description
source: Enter your email address that you used to register. We'll send you an email to recover your account
th: กรอกอีเมลล์ที่ท่านได้ทำการสมัครไว้ เราจะส่งอีเมลล์ในการตั้งค่ารหัสผ่านใหม่ไปให้ท่าน

source: Send
th: ส่ง

# send_email_for_reset_password_success
source: Send email for reset password successfully!
th: เราได้ทำการส่งอีเมลล์ให้ท่านเรียบร้อยแล้ว หากไม่พบกรุณาตรวจสอบที่อีเมลล์ขยะ

source: User Profile
th: โปรไฟล์

# credit_card_paypal
source: Credit card
th: บัตรเครดิต

source: Bank account
th: บัญชีธนาคาร

source: Help
th: ช่วยเหลือ

source: Settings
th: ตั้งค่า

source: Become a trainer
th: สมัครเป็นเทรนเนอร์

source: Logout
th: ออกจากระบบ

source: Pick your place
th: เลือกสถานที่

source: Progress
th: สถานะ

source: Course
th: คอร์ส

source: Notification
th: การแจ้งเตือน

source: Add schedule
th: จองเวลา

source: Fill in start date
th: วันที่เริ่มต้นการฝึก

source: Fill in start time
th: เวลาที่เริ่มต้นการฝึก

source: Confirm
th: ยืนยัน

source: Please fill in the blank
th: กรุณากรอกข้อมูลให้ครบ

source: Successfully add schedule place book to database
th: ระบบได้ทำการจองเวลาเรียบร้อยแล้ว

# confirm_progress
source: Confirm
th: ยืนยัน

# payment_progress
source: Payment
th: จ่ายเงิน

# ongoing_progress
source: Ongoing
th: กำลังฝึก

# successful_progress
source: Successful
th: สำเร็จ

source: Close
th: ปิด

source: Open
th: เปิด

source: Accept
th: ยอมรับ

source: Decline
th: ปฏิเสธ

source: Confirm to accept?
th: ยืนยันการยอมรับการฝึก?

source: Confirm to decline?
th: ยืนยันการปฏิเสธการฝึก?

source: Wait your trainee for pay
th: รอผู้ต้องการฝึกจ่ายเงิน

source: Ongoing schedule
th: อยู่ในระหว่างการฝึก

source: Successful schedule
th: การฝึกที่สำเร็จ

source: TRAINEE PROFILE
th: ข้อมูลของผู้ต้องการฝึก

source: Course detail
th: รายละเอียดการฝึก

source: PLACE
th: สถานที่การฝึก

source: Price
th: ราคา

source: Bath
th: บาท

source: times
th: ครั้ง

source: SCHEDULE
th: ตารางการฝึก

source: Pending
th: รอ

source: Ongoing
th: กำลังฝึก

source: Successful
th: สำเร็จแล้ว

source: Change schedule
th: เปลี่ยนการนัด

source: Change_schedule_requested
th: ร้องขอการเปลี่ยนเวลา

source: Plaese enter new schedule date and time
th: กรุณากรอกเวลานัดใหม่

source: New schedule date
th: วันที่ฝึกใหม่

source: New schedule time
th: เวลาฝึกใหม่

source: Are you sure to confirm training?
th: ยืนยันการฝึกสำเร็จหรือไม่?

source: Change schedule date and time successfully
th: เปลี่ยนวันและเวลาฝึกใหม่สำเร็จแล้ว

source: Confirm training successfully
th: ยืนยันการฝึกสำเร็จ

source: This course is finish!
th: การฝึกสำเร็จทั้งหมดแล้ว

source: Confirm training successfully and wait for trainee review
th: ยืนยันการฝึกสำเร็จและรอการรีวิวการผู้ต้องการฝึก

source: Edit
th: แก้ไข

source: Add
th: เพิ่ม

source: Delete
th: ลบ

source: Would you like to delete this course?
th: คุณต้องการลบคอร์สที่เลือกใช่หรือไม่

source: Delete course successfully!
th: ลบคอร์สสำเร็จแล้ว

source: Add course
th: เพิ่มคอร์ส

source: Course content
th: รายละเอียดของคอร์ส

source: Course type
th: ประเภทของคอร์ส

source: Time of course
th: จำนวนครั้งของคอร์ส

source: Course duration
th: ระยะเวลาการฝึกในแต่ละครั้ง

source: Course level
th: ความยากของการฝึก

source: Course price
th: ราคา

source: Course language
th: ภาษาที่ใช้ในการสื่อสาร

source: Successfully add course
th: เพิ่มคอร์สสำเร็จ

source: All level
th: ทุกระดับ

source: Intermediate
th: ปานกลาง

source: Beginner
th: เริ่มต้น

source: Expert
th: ผู้เชี่ยวชาญ

source: Healthy
th: เพื่อสุขภาพ

source: Fit and firm
th: เพื่อความฟิตของหุ่น

source: Competition
th: เพื่อการแข่งขัน

source: Successfully edit course
th: แก้ไขคอร์สสำเร็จแล้ว

# name_course
source: Course name
th: ชื่อคอร์ส

source: More
th: เพิ่มเติม

source: SECOND AGO
th: วินาทีที่แล้ว

source: SECONDS AGO
th: วินาทีที่แล้ว

source: MINUTE AGO
th: นาทีที่แล้ว

source: MINUTES AGO
th: นาทีที่แล้ว

source: HOUR AGO
th: ชั่วโมงที่แล้ว

source: HOURS AGO
th: ชั่วโมงที่แล้ว

source: DAY AGO
th: วันที่แล้ว

source: DAYS AGO
th: วันที่แล้ว

source: WEEK AGO
th: สัปดาห์ที่แล้ว

source: WEEKS AGO
th: สัปดาห์ที่แล้ว

source: Account name
th: ชื่อบัญชี

source: Account number
th: หมายเลขบัญชี

source: Bank name
th: ชื่อธนาคาร

source: Edit bank information successful! Please wait for approve
th: แก้ไขข้อมูลธนาคารสำเร็จ! รอการยืนยัน

source: Please correct your bank information
th: กรุณากรอกข้อมูลธนาคารให้ถูกต้อง

source: Add bank information successful! Please wait for approve
th: เพิ่มข้อมูลธนาคารสำเร็จ! รอการยืนยัน

source: Wait for approve
th: รอการยืนยัน

source: Language
th: ภาษา

source: Birthday
th: วันเกิด

source: Reviews
th: รีวิว

source: Rating
th: การโหวด

source: Edit profile
th: แก้ไขข้อมูลส่วนตัว

source: Save
th: บันทึก

source: Change
th: เปลี่ยน

# weight_edit_page
source: Weight (Kg)
th: นำ้หนัก (กก.)

# height_edit_page
source: Height (Cm)
th: ส่วนสูง (ซม.)

source: From camera
th: จากกล้อง

source: From photo library
th: จากไลบราลี่

source: Change profile data successfully
th: เปลี่ยนข้อมูลส่วนตัวสำเร็จแล้ว

source: Change password
th: เปลี่ยนรหัสผ่าน

source: Old password
th: รหัสเก่า

source: New password
th: รหัสใหม่

source: Confirm new password
th: ยืนยันรหัสใหม่

source: Change password successful
th: เปลี่ยนรหัสผ่านสำเร็จแล้ว

source: Old password and new password does not match
th: รหัสเก่าและรหัสใหม่ไม่ตรงกัน

source: Full review
th: รีวิวทั้งหมด

source: Total time of course
th: เวลาทั้งหมดของคอร์ส

source: Review
th: รีวิว

source: Note
th: โน๊ต

source: Next schedule date
th: วันในการฝึกครั้งต่อไป

source: Next schedule time
th: เวลาในการฝึกครั้งต่อไป

source: Finish this course
th: ปิดคอร์สนี้

source: Review and schedule next time training successfully
th: รีวิวและทำการจองวันและเวลาการฝึกครั้งต่อไปสำเร็จแล้ว

source: Finish this course succesfully
th: ทำการฝึกคอร์สนี้สำเร็จทั้งหมดแล้ว

source: Review succesfully and waiting for trainer confirm
th: รีวิวสำเร็จแล้วรอการยืนยันจากเทรนเนอร์

source: Review and schedule next time training successfully and waiting for trainer confirm
th: รีวิวและทำการจองวันและเวลาการฝึกครั้งต่อไปสำเร็จแล้ว รอการยืนยันจากเทรนเนอร์

source: Report
th: รายงาน

source: Confirm to report
th: ยืนยันการรายงาน

source: Report successfully
th: การรายงานสำเร็จ

source: Find your trainer
th: ค้นหาเทรนเนอร์

source: Select your trainer
th: เลือกเทรนเนอร์

source: Select course
th: เลือกคอร์ส

source: ิBook
th: จอง

source: Booking trainer
th: จองเทรนเนอร์

source: Trainer
th: เทรนเนอร์

source: Booking successful
th: ทำการจองเรียบร้อยแล้ว

source: Pay
th: จ่าย

source: Cancel this course?
th: ยกเลิกคอร์สนี้?

source: Please select your course to pay
th: เลือกคอร์สที่จะทำการจ่ายเงิน

source: TRAINER PROFILE
th: ข้อมูลเทรนเนอร์

source: Select your credit card
th: เลือกบัตรเครดิตที่ใช้ในการจ่ายเงิน

source: Error request
th: การส่งข้อมูลผิดพลาด

source: Confirm to pay?
th: ยืนยันการจ่ายเงิน?

source: Your payment successful
th: การจ่ายเงินสำเร็จ

source: Confirm to request change schedule?
th: ยืนยันการเปลี่ยนเวลานัด?

source: From
th: จาก

source: Request change schedule successful
th: ร้องขอการเปลี่ยนเวลาสำเร็จ

source: Delete credit card successful
th: การลบข้อมูลบัตรเครดิตสำเร็จ

source: Failed to delete credit card
th: การลบข้อมูลบัตรเครดิตล้มเหลว

source: Would you like to delete this credit card?
th: คุณต้องการที่จะลบข้อมูลบัตรเครดิตหรือไม่?

source: Add credit card
th: เพิ่มข้อมูลบัตรเครดิต

source: Card Holder
th: ชื่อเจ้าของบัตรเครดิต

source: Card information is not valid
th: ข้อมูลของบัตรเครดิตไม่ถูกต้อง

source: Add credit card successful!
th: เพิ่มบัตรเครดิตสำเร็จ!

source: Confirm to change card data
th: ยืนยันการเปลี่ยนข้อมูลบัตร

source: Card expiry
th: วันหมดอายุบัตร

source: Invalid expire
th: ข้อมูลวันหมดอายุบัตรผิดพลาด

source: Invalid card holder
th: ชื่อเจ้าของบัตรเครดิตผิดพลาด

source: Expire format must be in mm/YYYY Ex. 05/2018
th: วันหมดอายุจะต้องอยู่ในรูปแบบ เดือน/ปี เช่น 05/2018

source: Successful change card information
th: การเปลี่ยนข้อมูลบัตรเครดิตสำเร็จ

source: Error change card information
th: การเปลี่ยนข้อมูลบัตรเครดิตล้มเหลว

source: Edit credit card
th: แก้ไขข้อมูลบัตรเครดิต
